# dp[i] = i를 1,2,3의 합으로 나타내는 방법의 수

# dp[1]=1 # 1
# dp[2]=2 # 1+1,2
# dp[3]=4 # 1+1+1, 2+1 , 1+2, 3
# dp[4]=7 # 1+1+1+1, 2+1+1(3개), 2+2(1개), 3+1(2개)
# dp[5]=13 # 1+1+1+1, 2+1+1+1(4개), 2+2+1(3개), 3+1+1(3개), 3+2 (2개)
# dp[6]=24 # 1*6, 2+1+1+1+1(5개), 2+2+1+1(6개), 2+2+2(1개),3+1+1+1(4개),1+2+3(6개),3+3(1개)

# dp[i]=dp[i-3]+dp[i-2]+dp[i-1]

import sys
input=sys.stdin.readline

t=int(input())
dp=[1]*12
dp[2]=2
for i in range(3,12):
    dp[i]=dp[i-3]+dp[i-2]+dp[i-1]

for _ in range(t):
    print(dp[int(input())])